<a href="https://colab.research.google.com/github/carloscarvajal1cc/UTS_MachineLearning_Assigment2/blob/Edits/Missing_Values_learning_python.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
### adidng a change


## Treating missing values

andres

In [0]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

In [0]:
#figuring out what data is missing

#create a value called missing

missing = np.nan

# now lets create a series object, by calling the Series constructor and passing
#in a list that contains the values that we want the series to hold


series_obj = Series(['row 1', 'row 2', missing, 'row 4', 'row 5', 'row 6',
                    missing, 'row 8' ])

series_obj

0    row 1
1    row 2
2      NaN
3    row 4
4    row 5
5    row 6
6      NaN
7    row 8
dtype: object

In [0]:
# lets use pandas to figure out what is missing

# first method: the isnull method which is object_name.isnull()
#we get boolean values that indicates that false is not missing
#and true as its missing

series_obj.isnull()

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7    False
dtype: bool

In [0]:
#filling in for missing values

#lets setup seed to create a random number generator called from numpy

np.random.seed(25)


#Lets create a data frame called DF_obj and pass it the numpy randon number
#generator by writing np.random.randn(36)
#and then we call the reshape method after that to generate a 6 by 6
#matrix

DF_obj = DataFrame(np.random.randn(36).reshape(6,6))
DF_obj

          0         1         2         3         4         5
0  0.228273  1.026890 -0.839585 -0.591182 -0.956888 -0.222326
1 -0.619915  1.837905 -2.053231  0.868583 -0.920734 -0.232312
2  2.152957 -1.334661  0.076380 -1.246089  1.202272 -1.049942
3  1.056610 -0.419678  2.294842 -2.594487  2.822756  0.680889
4 -1.577693 -1.976254  0.533340 -0.290870 -0.513520  1.982626
5  0.226001 -1.839905  1.607671  0.388292  0.399732  0.405477

In [0]:
# now lets set some of these values in the data set as missing values

# lets set records 3 to 5 in the column indexed as cero and set records
#1 to 4 in the column indexed as 5 equal to missing.

# we do that by calling the object and using the method .ix[] specifying
#the rows , the columns and set it as missing.

DF_obj.loc[3:5,0] = missing
DF_obj.loc[1:4,5] = missing

DF_obj

#remember that .ix has been changed to .loc

          0         1         2         3         4         5
0  0.228273  1.026890 -0.839585 -0.591182 -0.956888 -0.222326
1 -0.619915  1.837905 -2.053231  0.868583 -0.920734       NaN
2  2.152957 -1.334661  0.076380 -1.246089  1.202272       NaN
3       NaN -0.419678  2.294842 -2.594487  2.822756       NaN
4       NaN -1.976254  0.533340 -0.290870 -0.513520       NaN
5       NaN -1.839905  1.607671  0.388292  0.399732  0.405477

In [0]:
#lets fill the NaN with the zero value by creating a new object
#with the method .fillna(0)

filled_DF = DF_obj.fillna(0)
filled_DF

          0         1         2         3         4         5
0  0.228273  1.026890 -0.839585 -0.591182 -0.956888 -0.222326
1 -0.619915  1.837905 -2.053231  0.868583 -0.920734  0.000000
2  2.152957 -1.334661  0.076380 -1.246089  1.202272  0.000000
3  0.000000 -0.419678  2.294842 -2.594487  2.822756  0.000000
4  0.000000 -1.976254  0.533340 -0.290870 -0.513520  0.000000
5  0.000000 -1.839905  1.607671  0.388292  0.399732  0.405477

In [0]:
#Now lets pass a dictionary into the .fillna() method with their own unique
#numbers and then columng by column basis.
#call the output of the function 

#for the values in column 0 lets set the values as 0.1 and for the values
#in column 5 set them with 1.25 by writing the following expression

filled_DF = DF_obj.fillna({0:0.1, 5:1.25})

#print

filled_DF

          0         1         2         3         4         5
0  0.228273  1.026890 -0.839585 -0.591182 -0.956888 -0.222326
1 -0.619915  1.837905 -2.053231  0.868583 -0.920734  1.250000
2  2.152957 -1.334661  0.076380 -1.246089  1.202272  1.250000
3  0.100000 -0.419678  2.294842 -2.594487  2.822756  1.250000
4  0.100000 -1.976254  0.533340 -0.290870 -0.513520  1.250000
5  0.100000 -1.839905  1.607671  0.388292  0.399732  0.405477

In [0]:
# now lets used the fill foward method

# you can fill missing values using ffill, it will fill the values
#with the last number encounter in the column

filled_DF = DF_obj.fillna(method = 'ffill')

filled_DF

          0         1         2         3         4         5
0  0.228273  1.026890 -0.839585 -0.591182 -0.956888 -0.222326
1 -0.619915  1.837905 -2.053231  0.868583 -0.920734 -0.222326
2  2.152957 -1.334661  0.076380 -1.246089  1.202272 -0.222326
3  2.152957 -0.419678  2.294842 -2.594487  2.822756 -0.222326
4  2.152957 -1.976254  0.533340 -0.290870 -0.513520 -0.222326
5  2.152957 -1.839905  1.607671  0.388292  0.399732  0.405477

In [0]:
# COUNT MISSING VALUES

# WHICH VARIABLES ARE MORE PROBLEMATIC.

np.random.seed(25)
DF_obj = DataFrame(np.random.randn(36).reshape(6,6))
DF_obj.loc[3:5,0] = missing
DF_obj.loc[1:4,5] = missing

DF_obj

          0         1         2         3         4         5
0  0.228273  1.026890 -0.839585 -0.591182 -0.956888 -0.222326
1 -0.619915  1.837905 -2.053231  0.868583 -0.920734       NaN
2  2.152957 -1.334661  0.076380 -1.246089  1.202272       NaN
3       NaN -0.419678  2.294842 -2.594487  2.822756       NaN
4       NaN -1.976254  0.533340 -0.290870 -0.513520       NaN
5       NaN -1.839905  1.607671  0.388292  0.399732  0.405477

In [0]:
# lets count missing values by calling .isnull and sum the values
# that are true by calling the method .sum()

DF_obj.isnull().sum()

0    3
1    0
2    0
3    0
4    0
5    4
dtype: int64

In [0]:
#filtering out missing values

# to identify and drop all the rows from a dataframe
#that contain any missing values we use the method .dropna() of the data
# frame object.
#to drop the columns we pass in the axis = 1 argument, to select and search
#the data frame by columns and not by rows. when axis = 0 it does it by rows

DF_no_NaN = DF_obj.dropna(axis = 1)
DF_no_NaN

          1         2         3         4
0  1.026890 -0.839585 -0.591182 -0.956888
1  1.837905 -2.053231  0.868583 -0.920734
2 -1.334661  0.076380 -1.246089  1.202272
3 -0.419678  2.294842 -2.594487  2.822756
4 -1.976254  0.533340 -0.290870 -0.513520
5 -1.839905  1.607671  0.388292  0.399732

In [0]:
# now lets use the drop.na method to only drop rows that contain 
# all missing values. however, this dataset doesnt have a row 
#with all missing values so it prints the same matrix
# to do this use pass the argument how='all'


DF_obj.dropna(how='all')

          0         1         2         3         4         5
0  0.228273  1.026890 -0.839585 -0.591182 -0.956888 -0.222326
1 -0.619915  1.837905 -2.053231  0.868583 -0.920734       NaN
2  2.152957 -1.334661  0.076380 -1.246089  1.202272       NaN
3       NaN -0.419678  2.294842 -2.594487  2.822756       NaN
4       NaN -1.976254  0.533340 -0.290870 -0.513520       NaN
5       NaN -1.839905  1.607671  0.388292  0.399732  0.405477